stuff/jmeter.log
2017/02/07 13:40:26 INFO  - jmeter.util.JMeterUtils: Setting Locale to en_US 
2017/02/07 13:40:26 INFO  - jmeter.JMeter: Loading user properties from: /Users/maci/development/elasticsearch/jmeter/bin/user.properties 
2017/02/07 13:40:26 INFO  - jmeter.JMeter: Loading system properties from: /Users/maci/development/elasticsearch/jmeter/bin/system.properties 
2017/02/07 13:40:26 INFO  - jmeter.JMeter: Copyright (c) 1998-2016 The Apache Software Foundation 
2017/02/07 13:40:26 INFO  - jmeter.JMeter: Version 3.1 r1770033 
2017/02/07 13:40:26 INFO  - jmeter.JMeter: java.version=1.8.0_112 
2017/02/07 13:40:26 INFO  - jmeter.JMeter: java.vm.name=Java HotSpot(TM) 64-Bit Server VM 
2017/02/07 13:40:26 INFO  - jmeter.JMeter: os.name=Mac OS X 
2017/02/07 13:40:26 INFO  - jmeter.JMeter: os.arch=x86_64 
2017/02/07 13:40:26 INFO  - jmeter.JMeter: os.version=10.11.6 
2017/02/07 13:40:26 INFO  - jmeter.JMeter: file.encoding=UTF-8 
2017/02/07 13:40:26 INFO  - jmeter.JMeter: Max memory     =514850816 
2017/02/07 13:40:26 INFO  - jmeter.JMeter: Available Processors =4 
2017/02/07 13:40:26 INFO  - jmeter.JMeter: Default Locale=English (United States) 
2017/02/07 13:40:26 INFO  - jmeter.JMeter: JMeter  Locale=English (United States) 
2017/02/07 13:40:26 INFO  - jmeter.JMeter: JMeterHome=/Users/maci/development/elasticsearch/jmeter 
2017/02/07 13:40:26 INFO  - jmeter.JMeter: user.dir  =/Users/maci/development/elasticsearch/stuff 
2017/02/07 13:40:26 INFO  - jmeter.JMeter: PWD       =/Users/maci/development/elasticsearch/stuff 
2017/02/07 13:40:26 INFO  - jmeter.JMeter: IP: 10.101.6.70 Name: mac150042.local FullName: 10.101.6.70 
2017/02/07 13:40:26 INFO  - jmeter.services.FileServer: Default base='/Users/maci/development/elasticsearch/stuff' 
2017/02/07 13:40:26 INFO  - jmeter.services.FileServer: Set new base='/Users/maci/development/elasticsearch/stuff/.' 
2017/02/07 13:40:26 INFO  - jmeter.save.SaveService: Testplan (JMX) version: 2.2. Testlog (JTL) version: 2.2 
2017/02/07 13:40:26 INFO  - jmeter.save.SaveService: Using SaveService properties file encoding UTF-8 
2017/02/07 13:40:26 INFO  - jmeter.save.SaveService: Using SaveService properties version 3.1 
2017/02/07 13:40:26 INFO  - jmeter.save.SaveService: All converter versions present and correct 
2017/02/07 13:40:26 INFO  - jmeter.save.SaveService: Loading file: ./pierdoly.jmx 
2017/02/07 13:40:26 INFO  - jmeter.protocol.http.sampler.HTTPSamplerBase: Parser for text/html is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser 
2017/02/07 13:40:26 INFO  - jmeter.protocol.http.sampler.HTTPSamplerBase: Parser for application/xhtml+xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser 
2017/02/07 13:40:26 INFO  - jmeter.protocol.http.sampler.HTTPSamplerBase: Parser for application/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser 
2017/02/07 13:40:26 INFO  - jmeter.protocol.http.sampler.HTTPSamplerBase: Parser for text/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser 
2017/02/07 13:40:26 INFO  - jmeter.protocol.http.sampler.HTTPSamplerBase: Parser for text/vnd.wap.wml is org.apache.jmeter.protocol.http.parser.RegexpHTMLParser 
2017/02/07 13:40:26 INFO  - jmeter.protocol.http.sampler.HTTPSamplerBase: Parser for text/css is org.apache.jmeter.protocol.http.parser.CssParser 
2017/02/07 13:40:26 INFO  - jmeter.JMeter: Creating summariser <summary> 
2017/02/07 13:40:26 INFO  - jmeter.engine.StandardJMeterEngine: Running the test! 
2017/02/07 13:40:26 INFO  - jmeter.samplers.SampleEvent: List of sample_variables: [] 
2017/02/07 13:40:26 INFO  - jmeter.samplers.SampleEvent: List of sample_variables: [] 
2017/02/07 13:40:26 INFO  - jmeter.engine.util.CompoundVariable: Note: Function class names must contain the string: '.functions.' 
2017/02/07 13:40:26 INFO  - jmeter.engine.util.CompoundVariable: Note: Function class names must not contain the string: '.gui.' 
2017/02/07 13:40:27 INFO  - jmeter.JMeter: Running test (1486471227019) 
2017/02/07 13:40:27 INFO  - jmeter.engine.StandardJMeterEngine: Starting ThreadGroup: 1 : jp@gc - Ultimate Thread Group 
2017/02/07 13:40:27 INFO  - jmeter.engine.StandardJMeterEngine: Starting 10 threads for group jp@gc - Ultimate Thread Group. 
2017/02/07 13:40:27 INFO  - jmeter.engine.StandardJMeterEngine: Thread will continue on error 
2017/02/07 13:40:27 INFO  - kg.apc.jmeter.threads.AbstractSimpleThreadGroup: Starting thread group number 1 threads 10 
2017/02/07 13:40:27 INFO  - kg.apc.jmeter.threads.AbstractSimpleThreadGroup: Started thread group number 1 
2017/02/07 13:40:27 INFO  - jmeter.engine.StandardJMeterEngine: All thread groups have been started 
2017/02/07 13:40:28 INFO  - jmeter.threads.JMeterThread: Thread started: jp@gc - Ultimate Thread Group 1-10 
2017/02/07 13:40:28 WARN  - kg.apc.jmeter.timers.VariableThroughputTimer: No free threads left in worker pool, made  0/1.0 samples 
2017/02/07 13:40:28 INFO  - jmeter.protocol.http.sampler.HTTPHCAbstractImpl: Local host = mac150042.local 
2017/02/07 13:40:28 INFO  - jmeter.protocol.http.sampler.HTTPHC4Impl: HTTP request retry count = 0 
2017/02/07 13:40:28 INFO  - jmeter.samplers.SampleResult: Note: Sample TimeStamps are START times 
2017/02/07 13:40:28 INFO  - jmeter.samplers.SampleResult: sampleresult.default.encoding is set to ISO-8859-1 
2017/02/07 13:40:28 INFO  - jmeter.samplers.SampleResult: sampleresult.useNanoTime=true 
2017/02/07 13:40:28 INFO  - jmeter.samplers.SampleResult: sampleresult.nanoThreadSleep=5000 
2017/02/07 13:40:29 INFO  - jmeter.threads.JMeterThread: Thread started: jp@gc - Ultimate Thread Group 1-9 
2017/02/07 13:40:30 INFO  - jmeter.threads.JMeterThread: Thread started: jp@gc - Ultimate Thread Group 1-8 
2017/02/07 13:40:30 INFO  - jmeter.reporters.Summariser: summary +      5 in 00:00:03 =    1.6/s Avg:    37 Min:    17 Max:   109 Err:     0 (0.00%) Active: 3 Started: 3 Finished: 0 
2017/02/07 13:40:31 INFO  - jmeter.threads.JMeterThread: Thread started: jp@gc - Ultimate Thread Group 1-7 
2017/02/07 13:40:32 INFO  - jmeter.threads.JMeterThread: Thread started: jp@gc - Ultimate Thread Group 1-6 
2017/02/07 13:40:33 INFO  - jmeter.threads.JMeterThread: Thread started: jp@gc - Ultimate Thread Group 1-5 
2017/02/07 13:40:34 INFO  - jmeter.threads.JMeterThread: Thread started: jp@gc - Ultimate Thread Group 1-4 
2017/02/07 13:40:35 INFO  - jmeter.threads.JMeterThread: Thread started: jp@gc - Ultimate Thread Group 1-3 
2017/02/07 13:40:36 INFO  - jmeter.threads.JMeterThread: Thread started: jp@gc - Ultimate Thread Group 1-2 
2017/02/07 13:40:37 INFO  - jmeter.threads.JMeterThread: Thread started: jp@gc - Ultimate Thread Group 1-1 
2017/02/07 13:41:00 INFO  - jmeter.reporters.Summariser: summary +    382 in 00:00:30 =   12.7/s Avg:    24 Min:    13 Max:    60 Err:     0 (0.00%) Active: 10 Started: 10 Finished: 0 
2017/02/07 13:41:00 INFO  - jmeter.reporters.Summariser: summary =    387 in 00:00:33 =   11.7/s Avg:    24 Min:    13 Max:   109 Err:     0 (0.00%) 
2017/02/07 13:41:30 INFO  - jmeter.reporters.Summariser: summary +    421 in 00:00:30 =   14.0/s Avg:    22 Min:    13 Max:    52 Err:     0 (0.00%) Active: 10 Started: 10 Finished: 0 
2017/02/07 13:41:30 INFO  - jmeter.reporters.Summariser: summary =    808 in 00:01:03 =   12.8/s Avg:    23 Min:    13 Max:   109 Err:     0 (0.00%) 
2017/02/07 13:42:00 INFO  - jmeter.reporters.Summariser: summary +    426 in 00:00:30 =   14.2/s Avg:    25 Min:    13 Max:  1458 Err:     0 (0.00%) Active: 10 Started: 10 Finished: 0 
2017/02/07 13:42:00 INFO  - jmeter.reporters.Summariser: summary =   1234 in 00:01:33 =   13.3/s Avg:    24 Min:    13 Max:  1458 Err:     0 (0.00%) 
2017/02/07 13:42:30 INFO  - jmeter.reporters.Summariser: summary +    423 in 00:00:30 =   14.1/s Avg:    27 Min:    13 Max:  1506 Err:     0 (0.00%) Active: 10 Started: 10 Finished: 0 
2017/02/07 13:42:30 INFO  - jmeter.reporters.Summariser: summary =   1657 in 00:02:03 =   13.5/s Avg:    25 Min:    13 Max:  1506 Err:     0 (0.00%) 
2017/02/07 13:42:38 INFO  - jmeter.threads.JMeterThread: Stopping because end time detected by thread: jp@gc - Ultimate Thread Group 1-10 
2017/02/07 13:42:38 INFO  - jmeter.threads.JMeterThread: Thread finished: jp@gc - Ultimate Thread Group 1-10 
2017/02/07 13:42:39 INFO  - jmeter.threads.JMeterThread: Stopping because end time detected by thread: jp@gc - Ultimate Thread Group 1-9 
2017/02/07 13:42:39 INFO  - jmeter.threads.JMeterThread: Thread finished: jp@gc - Ultimate Thread Group 1-9 
2017/02/07 13:42:40 INFO  - jmeter.threads.JMeterThread: Stopping because end time detected by thread: jp@gc - Ultimate Thread Group 1-8 
2017/02/07 13:42:40 INFO  - jmeter.threads.JMeterThread: Thread finished: jp@gc - Ultimate Thread Group 1-8 
2017/02/07 13:42:41 INFO  - jmeter.threads.JMeterThread: Stopping because end time detected by thread: jp@gc - Ultimate Thread Group 1-7 
2017/02/07 13:42:41 INFO  - jmeter.threads.JMeterThread: Thread finished: jp@gc - Ultimate Thread Group 1-7 
2017/02/07 13:42:42 INFO  - jmeter.threads.JMeterThread: Stopping because end time detected by thread: jp@gc - Ultimate Thread Group 1-6 
2017/02/07 13:42:42 INFO  - jmeter.threads.JMeterThread: Thread finished: jp@gc - Ultimate Thread Group 1-6 
2017/02/07 13:42:43 INFO  - jmeter.threads.JMeterThread: Stopping because end time detected by thread: jp@gc - Ultimate Thread Group 1-5 
2017/02/07 13:42:43 INFO  - jmeter.threads.JMeterThread: Thread finished: jp@gc - Ultimate Thread Group 1-5 
2017/02/07 13:42:44 INFO  - jmeter.threads.JMeterThread: Stopping because end time detected by thread: jp@gc - Ultimate Thread Group 1-4 
2017/02/07 13:42:44 INFO  - jmeter.threads.JMeterThread: Thread finished: jp@gc - Ultimate Thread Group 1-4 
2017/02/07 13:42:45 INFO  - jmeter.threads.JMeterThread: Stopping because end time detected by thread: jp@gc - Ultimate Thread Group 1-3 
2017/02/07 13:42:45 INFO  - jmeter.threads.JMeterThread: Thread finished: jp@gc - Ultimate Thread Group 1-3 
2017/02/07 13:42:46 INFO  - jmeter.threads.JMeterThread: Stopping because end time detected by thread: jp@gc - Ultimate Thread Group 1-2 
2017/02/07 13:42:46 INFO  - jmeter.threads.JMeterThread: Thread finished: jp@gc - Ultimate Thread Group 1-2 
2017/02/07 13:42:47 WARN  - kg.apc.jmeter.timers.VariableThroughputTimer: No free threads left in worker pool, made  15/15.0 samples 
2017/02/07 13:42:47 INFO  - jmeter.threads.JMeterThread: Stopping because end time detected by thread: jp@gc - Ultimate Thread Group 1-1 
2017/02/07 13:42:47 INFO  - jmeter.threads.JMeterThread: Thread finished: jp@gc - Ultimate Thread Group 1-1 
2017/02/07 13:42:47 INFO  - jmeter.engine.StandardJMeterEngine: Notifying test listeners of end of test 
2017/02/07 13:42:47 INFO  - jmeter.reporters.Summariser: summary +    244 in 00:00:17 =   14.3/s Avg:    22 Min:     1 Max:   202 Err:     1 (0.41%) Active: 0 Started: 10 Finished: 10 
2017/02/07 13:42:47 INFO  - jmeter.reporters.Summariser: summary =   1901 in 00:02:20 =   13.6/s Avg:    24 Min:     1 Max:  1506 Err:     1 (0.05%)